Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་རྣམས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱི་བར་དག་ལ་རབ་ཏུ་འགོད་པར་གྱུར་ཅིག །
en: May I establish beings in the ten good courses of action.

source: སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པ་དག་ཀྱང་དགེ་བའི་ལས་ཀྱི་ལམ་རྣམས་ཀྱིས་ཡོངས་སུ་སྦྱོང་བར་གྱུར་ཅིག །
en: May I help purify the kleśas of beings by means of the good courses of action.

source: ཐེག་པ་གསུམ་པོ་དག་ལ་ཡང་སྦྱོར་བར་གྱུར་ཅིག །
en: May I enjoin them to the three yānas.

source: སྙིགས་མ་ལྔ་དག་ཡོངས་སུ་སྤོང་བར་གྱུར་ཅིག །
en: May I help them abandon the five degeneracies.

source: སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱད་ཁྲི་ཐུབ་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །འདོད་ཆགས་དང་།
en: When beings live for eighty thousand years, may I attain the complete enlightenment of perfect buddhahood.

source: ཞེ་སྡང་དང་། གཏི་མུག་དང་། མ་རིག་པ་དང་། ཕྲག་དོག་དང་། སེར་སྣ་ཆུང་བའི་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཅིང་ཐེག་པ་གསུམ་པོ་དག་ལ་ཡང་དག་པར་སྦྱོར་བར་གྱུར་ཅིག །
en: May I teach the Dharma to beings with little desire, anger, stupidity, ignorance, envy, and greed, and may I enjoin them to the three yānas. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་བླ་ན་མེད་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་དུ་གསོལ།
en: Bhadanta Bhagavat, if this wish of mine is to be completely fulfilled, may the Bhagavat give me the prophecy of my highest, most complete enlightenment.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གང་གི་ཚེ་བདག་དེ་ལྟར་ལུང་བསྟན་པ་ཐོབ་ནས་ཐེག་པ་གང་གིས་མྱུར་དུ་འཁོར་བ་ལས་འགྲོལ་བར་འགྱུར་བའི་ཉན་ཐོས་ཀྱིས་ཡང་དོན་དུ་མི་གཉེར་ལ། རང་སངས་རྒྱས་ཀྱིས་ཡང་དོན་དུ་མི་གཉེར་ལགས་སོ།
en: Bhadanta Bhagavat, when I receive such prophecy, I will not be dedicated to the śrāvaka level nor to the level of a pratyekabuddha, by which yānas I would swiftly be liberated from saṃsāra.’ “

source: །དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། བྲམ་ཟེའི་ཁྱེའུ་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་རྣམས་ཀྱི་དངོས་པོ་ནི་བཞི་པོ་འདི་དག་ཡིན་ཏེ།
en: The Tathāgata Ratnagarbha said, ‘Young brahmin, there are these four kinds of laziness for bodhisattvas.

source: ལེ་ལོའི་དངོས་པོ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་ནི་ཡུན་རིང་པོར་འཁོར་བར་འདོད་དེ། ལྟ་བའི་གཡང་ས་དང་། འཁོར་བའི་བཙོན་རར་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བར་འགྱུར་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མྱུར་དུ་འཐོབ་པར་མི་འགྱུར་རོ།
en: Some bodhisattvas who have such laziness while wishing to remain in saṃsāra for a long time experience the suffering of the precipice of views and the dungeon of saṃsāra, and they do not quickly attain the highest, most complete enlightenment.

source: །བཞི་གང་ཞེ་ན།
en: What are those four?

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལ་ལ་ཆོ་ག་དམན་པ་དང་། གྲོགས་དམན་པ་དང་། ཡོངས་སུ་གཏོང་བ་དམན་པ་དང་། སྨོན་ལམ་དམན་པ་ཡིན་ཏེ།
en: They are when bodhisattvas have inferior practice, inferior companions, inferior generosity, and inferior prayer.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོ་ག་དམན་པ་ཡིན་ཞེ་ན།
en: How is it that bodhisattvas have inferior practice, and so on?

source: འདི་ལ་ལུས་དང་། ངག་དང་ཡིད་ཀྱི་སྤྱོད་པ་མ་བསྡམས་ཤིང་ཚུལ་ཁྲིམས་འཆལ་པ་དང་།
en: It is having incorrect conduct and not guarding body, speech, and mind.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའི་སེམས་ཅན་རྣམས་དང་ལྷན་ཅིག་འགྲོགས་ཤིང་རྒྱུ་བ་དང་།
en: It is being in the company of those of the śrāvaka and pratyekabuddha yānas.

source: ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་ཞིང་ཀུན་ལ་ཡང་ཡོངས་སུ་མི་གཏོང་ལ་ལྷ་དང་མིའི་དཔལ་དང་བདེ་བ་འདོད་པའི་ཕྱིར་སྦྱིན་པ་སྦྱིན་པར་བྱེད་པ་དང་།
en: It is not being able to give away everything, not being able to give away to everyone; it is acts of generosity made out of a desire for the prosperity and happiness of devas and humans.

source: ལྷག་པའི་བསམ་པས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཡང་ཡོངས་སུ་མི་ལེན་ཅིང་འདུལ་བ་ལ་རྟོག་པའི་སྨོན་ལམ་ཡང་ཡོངས་སུ་མི་ལེན་པ་ཡིན་ཏེ།
en: It is not taking up, with a higher motivation, the array of qualities of a buddha realm, but taking up prayers without being focused on guiding beings.

source: ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ནི་ཡུན་རིང་པོར་འཁོར་བའི་བཙོན་རར་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བར་འགྱུར་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མྱུར་དུ་ཐོབ་པར་མི་འགྱུར་རོ།
en: The lazy bodhisattvas who have those four qualities experience suffering for a long time in the dungeon of saṃsāra and do not quickly attain the highest, most complete enlightenment. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: Bodhisattvas who possess four qualities quickly attain the highest, most complete enlightenment.

source: ལུས་དང་ངག་དང་ཡིད་ཀྱི་སྤྱོད་པ་བསྡམས་ཤིང་ཚུལ་ཁྲིམས་དང་ལྡན་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་དང་། ལྷན་ཅིག་འགྲོགས་ཤིང་རྒྱུ་བ་དང་། ཐམས་ཅད་ཡོངས་སུ་གཏོང་ཞིང་ཀུན་ལ་ཡང་ཡོངས་སུ་གཏོང་ལ་སེམས་ཅན་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱ་བའི་ཕྱིར་སྙིང་རྗེའི་སེམས་བསྐྱེད་ཅིང་སྦྱིན་པར་བྱེད་པ་དང་། ལྷག་པའི་བསམ་པས་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དང་།
en: They are the possession of correct conduct and guarding body, speech, and mind; remaining in the company of those who have entered the Mahāyāna; having the ability to give away everything, to give away to everyone, and performing acts of generosity through the compassionate motivation of wishing to free beings from suffering; and with an altruistic motivation choosing the arrays of qualities of a buddha realm and making prayers while focused on guiding beings.

source: འདུལ་བ་ལ་རྟོག་པའི་སྨོན་ལམ་ཡོངས་སུ་འཛིན་པར་བྱེད་པ་སྟེ། ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Bodhisattvas who have those four qualities quickly attain the highest, most complete enlightenment. “ ‘

source: །ཆོས་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ཉེ་བར་རྟོན་པར་བྱེད་པ་ཡིན་ཏེ།
en: There are four qualities upon which the path of the bodhisattvas depends.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་མངོན་པར་བརྩོན་པ་དང་། སེམས་ཅན་རྣམས་ལ་བསྡུ་བའི་དངོས་པོ་གཏོང་བ་དང་། ཚངས་པའི་གནས་པ་མངོན་པར་སྒྲུབ་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཀྱིས་རྣམ་པར་རྩེ་བ་ཡིན་ནོ།
en: They are diligence in the perfections, practicing the methods for gathering beings, accomplishing the brahmavihāras, and displaying the clairvoyances. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞིས་ངོམས་མི་མྱོང་བར་གནས་པར་བྱ་སྟེ།
en: There are four qualities of which the bodhisattvas should never have enough.

source: སྦྱིན་པས་ངོམས་མི་མྱོང་བ་དང་། ཆོས་ཉན་པས་ངོམས་མི་མྱོང་བ་དང་། བསྒོམ་པས་ངོམས་མི་མྱོང་བ་དང་། སེམས་ཅན་རྣམས་ལ་བསྡུ་བའི་དངོས་པོས་ངོམས་མི་མྱོང་བར་གནས་པར་བྱ་བ་དག་གོ།
en: The bodhisattvas should never have enough of accomplishing acts of generosity; they should never have enough of listening to the Dharma; they should never have enough of meditation; and they should never have enough of gathering beings. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔས་མི་ཟད་པའི་གཏེར་བཞི་པོ་འདི་དག་ཡོངས་སུ་རྫོགས་པར་བྱ་སྟེ།
en: There are four inexhaustible treasures that the bodhisattvas should completely perfect.

source: བྱང་ཆུབ་སེམས་དཔས་དད་པ་མི་ཟད་པའི་གཏེར་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། ཆོས་བསྟན་པ་དང་། ཡོངས་སུ་བསྔོ་བ་དང་། སེམས་ཅན་དབུལ་པོ་ཡོངས་སུ་གཟུང་བ་མི་ཟད་པའི་གཏེར་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དག་གོ།
en: The bodhisattvas should completely perfect the inexhaustible treasure of faith, of the teaching of the Dharma, of dedication, and of caring for poor beings. “ ‘

source: །བཞི་པོ་འདི་དག་ནི་བདག་མེད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་དག་པ་ཡིན་ཏེ།
en: There are the four purities of bodhisattvas because there is no self.

source: སེམས་ཅན་མེད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པ་དང་། སྲོག་མེད་པའི་ཕྱིར་ཏིང་ངེ་འཛིན་ཡོངས་སུ་དག་པ་དང་། གང་ཟག་མེད་པའི་ཕྱིར་ཤེས་རབ་ཡོངས་སུ་དག་པ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕྱིར་རྣམ་པར་གྲོལ་བ་ཡོངས་སུ་དག་པ་སྟེ།
en: They are the purity of correct conduct because there is no being; the purity of samādhi because there is no soul; the purity of wisdom because there is no individual; and the purity of knowledge through the vision of the knowledge of liberation.

source: བྱང་ཆུབ་སེམས་དཔས་ཆོས་བཞི་པོ་དེ་དག་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: Those are the four qualities that should be perfected by the bodhisattvas. “ ‘

source: །དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་ཞིང་ནམ་མཁའི་འཁོར་ལོ་ཡང་སྐོར་བར་བྱེད། མི་རྟག་པའི་འཁོར་ལོ་དང་། མི་མཉམ་པའི་འཁོར་ལོ་དང་། བརྗོད་དུ་མེད་པའི་འཁོར་ལོ་དང་། ངེས་པར་འབྱིན་པའི་འཁོར་ལོ་དང་།
en: Through these, bodhisattvas quickly attain the complete enlightenment of perfect buddhahood, and they turn the wheel of space, the inconceivable wheel, the unequaled wheel, the inexpressible wheel, the liberating wheel, the penetrating wheel, and the unturning wheel. “ ‘

source: ངེས་པར་འབྱེད་པའི་འཁོར་ལོ་དང་། བསྐོར་དུ་མེད་པའི་འཁོར་ལོ་ཡང་སྐོར་བར་བྱེད་དོ། །བགྲོད་བྱའི་བུ་དྲི་མ་མེད་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ཏེ། བསྐལ་པ་བཟང་པོ་ལ་བབ་ནས་རིང་པོ་མ་ལོན་ཞིང་སྙིགས་མ་ལྔ་རབ་ཏུ་ཞི་བའི་དུས་ལ་བབ་པ་ན་སྐྱེ་དགུ་ཚེ་ལོ་བརྒྱད་ཁྲི་ཐུབ་པ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: Vimalavaiśāyana, in the future, after an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, in which there are as many years as there are grains of sand in the Ganges River, not long after the Bhadraka eon has begun, there will be a time when the five degeneracies have ceased and the lifespan of beings increases to eighty thousand years.

source: དེ་བཞིན་གཤེགས་པ་བྱམས་པ་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ།
en: At that time, you will attain the complete enlightenment of perfect buddhahood. You will become the tathāgata, and so on, up to and including the bhagavat buddha, named Maitreya.’ “

source: །བྲམ་ཟེའི་ཁྱེའུ་བགྲོད་བྱའི་བུ་དྲི་མ་མེད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས། བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་དང་། མེ་ཏོག་ཕྲེང་དང་། ཕྱེ་མ་དག་གིས་མཆོད་པ་བྱེད་པ་ལ་བརྩོན་ཞིང་ཚིགས་སུ་བཅད་པས་མངོན་པར་བསྟོད་པ། མགོན་པོ་ཁྱོད་ནི་འཕྲལ་བའི་དབྱེས་ཆེ་མཛོད་སྤུ་གངས་མདོག་མཛེས།
en: The young brahmin Vimalavaiśāyana bowed down the five points of his body to the feet of the Tathāgata Ratnagarbha, stood to one side, and, with flowers, flower garlands, and powders, made offerings to the Bhagavat and praised him with this verse: “ ‘Lord, on your broad forehead is a splendid ūrṇā hair the color of snow.

source: ཁྱོད་ནི་གསེར་གྱི་རི་བོ་བརྩེགས་པ་འདྲ་ཞིང་ཡིད་དུ་མཆི།
en: You appear in my mind like a massive golden mountain.

source: །ཡོན་ཏན་བརྒྱས་བལྟམས་བདག་དུས་འདི་གསུངས་འགྲོ་ནའང་བདག་འཚང་རྒྱ། །ཐུབ་པ་ཁྱུ་མཆོག་འཇིག་རྟེན་སྒྲོན་ཁྱོད་ལ་ནི་སུ་མི་འདུད།
en: Sage, leader, light of the world, bearer of hundreds of qualities, who would not bow down to you At this time when you have told me that I will attain buddhahood?’ “

source: །བྲམ་ཟེ་མདུན་ན་འདོན་རྒྱ་མཚོའི་རྡུལ་གྱིས། བྲམ་ཟེའི་ཁྱེའུ་རིག་བྱེད་ཀློག་པ་སྟོང་པོ་ཐམས་ཅད་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ནས། ཇི་ལྟར་འཁོར་བ་འཇིག་དང་། གསེར་ཐུབ་དང་།
en: The brahmin royal priest Samudrareṇu caused all of the thousand young Veda-reciting brahmins to aspire to enlightenment.

source: འོད་སྲུང་དང་། བྱམས་པ་ལུང་བསྟན་པ་དེ་བཞིན་དུ། བྲམ་ཟེའི་ཁྱེའུ་རིག་བྱེད་ཀློག་པ་སེང་གེ་དང་། མཆོག་ཏུ་དགའ་བ་དང་། དགུ་བརྒྱ་དགུ་བཅུ་རྩ་དགུའི་བར་དུ་ཐམས་ཅད་ཀྱིས་ཀྱང་བསྐལ་པ་བཟང་པོ་འདི་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་ནས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བཀོད་དོ།
en: Just as Krakucchanda, Kanakamuni, Kāśyapa, and Maitreya were prophesied, in the same way Siṃha, Pradyota, and so on were all set to the highest, most complete enlightenment by the Tathāgata Ratnagarbha in this Bhadraka eon when a further 999 of the young Veda-reciting brahmins prayed to attain the complete enlightenment of perfect buddhahood in this Bhadraka eon. “

source: །དེ་དག་ཐམས་ཅད་ཀྱི་ནུ་བོ་ཐ་ཆུངས་གང་ཡིན་པ་དེ་ལ་ཡང་མདུན་ན་འདོན་གྱིས་འདི་སྐད་དུ་ཀྱེ་བྲམ་ཟེའི་ཁྱེའུ་སྟོབས་ཆེན་ཤུགས་འཆང་རིང་དུ་བརྟག་ཏུ་ཅི་ཡོད།
en: The royal priest then encouraged the youngest among them, who had not yet made his prayer, saying, ‘Dear Mahābalavegadhārin, why are you thinking about this for so long?

source: སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེད་ཅིག་ཅེས་ཡང་དག་པར་བསྐུལ་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་ཀྱང་མངོན་པར་གོ་བར་བྱས་སོ།
en: You must develop great compassion for beings.’

source: །སེམས་ཅན་གང་དག་རྒ་དང་ནད་དང་འཆི་འཕོའི་འཇིགས་པ་སྲེད་པའི་ཀླུང་དུ་ལྷུང་བ་དང་།
en: And with these verses he instructed him: “ ‘These beings who are terrified by aging, illness, and death have fallen into the river of craving.

source: །ཕུང་པོ་རྣམས་ལ་ཞེན་པའི་མི་དག་སྲིད་པའི་བཙོན་ར་རབ་ཏུ་འཇིགས་པར་ཆུད་པ་རྣམས།
en: The humans attached to the aggregates have been thrown into the terrible dungeon of existence.

source: །ཕན་ཚུན་གསོད་པར་བྱེད་པའི་ཉོན་མོངས་དུག་འཐུངས་ནས་ནི་སྡུག་བསྔལ་རྒྱ་མཚོར་རབ་ཏུ་གནས།
en: Having drunk the poison of the kleśas, killing each other, they remain in the sea of suffering.

source: །གཏི་མུག་གིས་ནི་ལམ་སྟོར་ལོང་བ་བཞིན་དུ་མི་གཙང་འཁྲུལ་འཁོར་དག་ན་འཁྱམ་པར་འགྱུར།
en: Ignorant, blind, having lost their way, they are wandering in the harmful clutches of saṃsāra. “ ‘

source: །ལོག་པར་ལྟ་ལ་གནས་པས་འབྱུང་པོ་ཐམས་ཅད་སྲིད་པ་གསུམ་ན་སྡུག་བསྔལ་རྣམས་ཀྱིས་འབར།
en: Remaining in wrong views, beings are ablaze with suffering throughout the entire three realms.

source: །སྲོག་ཆགས་ཐམས་ཅད་འགྲོ་བ་ལྔ་པོ་དག་ན་ཇི་ལྟར་འཁོར་ལོ་འཁོར་བ་བཞིན་དུ་འཁོར།
en: All living creatures wander through the five existences, just like on a turning wheel.

source: །འགྲོ་བ་ལྔ་པོ་དག་ན་ཆོས་ཀྱི་མིག་ཉམས་སྐྱབས་མེད་སེམས་ཅན་རྣམས་ནི་དྲན་གྱིས་ལ།
en: Remain mindful of beings who do not have the eye of the Dharma, unprotected in the five existences.

source: །ཡང་དག་ཤེས་རབ་ཀྱིས་ནི་ནེམ་ནུར་ཡིད་གཉིས་སྤོངས་ལ་བྱང་ཆུབ་དོན་དུ་འདུན་པ་སྐྱེད།
en: Be wise, abandon uncertainty and doubt, and develop the yearning for enlightenment. “ ‘

source: །འགྲོ་བ་རྣམས་ཀྱི་སྲེད་པའི་མྱ་ངན་སོལ་ལ་སེམས་ཅན་རྣམས་ཀྱི་གཉེན་དུ་གྱུར་པར་གྱིས།
en: Become one who ends the misery of craving for beings and be a friend to beings.

source: །འགྲོ་བའི་ཉོན་མོངས་འཆིང་བ་དགྲལ་བར་བྱ་ཕྱིར་བྱང་ཆུབ་དོན་དུ་སེམས་ཀྱང་གཞོལ་གྱིས་ཤིག །གཏི་མུག་བྲལ་བ་ཆོས་མིག་རྣམ་པར་ཉམས་པ་རྣམས་ལ་ལམ་གྱི་དམ་པ་སྦྱིན་པར་གྱིས།
en: In order to liberate beings from the bondage of the kleśas, be dedicated to the aspiration to enlightenment, And bestow the most excellent path free from ignorance to those who do not have the eye of Dharma.

source: །འཁོར་བའི་སྲིད་པའི་བཙོན་ར་དག་ན་འབར་བ་རྣམས་ལ་ཆོས་ཀྱི་བཅུད་ཀྱིས་ཚིམ་གྱིས་ཤིག །
en: Refresh with the elixir of the Dharma those who are burning in the dungeons of saṃsāra’s existences. “ ‘

source: ཕན་པར་བྱེད་པ་ཁྱོད་ནི་མྱུར་དུ་ཉེ་བར་སོང་ལ་ཐུབ་པའི་ཞབས་ལ་གཏུགས་པ་གྱིས།
en: O one who brings benefit, go quickly and bow down at the feet of the sage.

source: །རེ་བ་ཐམས་ཅད་གྲུབ་སྨོན་བཀྲ་ཤིས་ལྡན་པ་རབ་བརྟན་འདྲེན་པས་སངས་རྒྱས་འགྱུར་བར་བྱོས།
en: Become a buddha through being a steadfast guide who is auspicious and aspires to fulfill all hopes.

source: །འཇིག་རྟེན་དག་ན་སེམས་ཅན་རྣམས་ཀྱི་དབུགས་འབྱིན་གྱིས་ལ་སྲིད་པའི་མཚོ་ལས་སེམས་ཅན་ཐོན།
en: Become one who brings relief to beings, saving them from the sea of existence.

source: །གྱ་ནོམ་ཐར་པའི་ལམ་དང་དབང་པོའི་སྟོབས་དང་བྱང་ཆུབ་ཡན་ལག་སྦྱིན་བྱེད་འགྱུར་བར་གྱིས།
en: Become one who leads others on the path to liberation, bestowing them with the powers, strengths, and factors of enlightenment.

source: །ཆོས་སྤྲིན་ཆོས་ཀྱི་ཆར་པ་རབ་ཏུ་ཕོབ་སྟེ་སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་ཞི་བར་གྱིས།
en: Send down the rain of Dharma from the clouds of Dharma to pacify the sufferings of beings.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྟོབས་ཆེན་ཤུགས་འཆང་དེས་ཀྱང་སྨྲས་པ། མཁན་པོ་བདག་ནི་འཁོར་བ་ལས་མངོན་པར་དགའ་བའི་དཔལ་མི་འཚལ་ལ།
en: Then, noble son, the brahmin youth Mahābalavegadhārin said, ‘Upādhyāya, I do not seek the splendor of joy in saṃsāra.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ཡང་མི་འཚལ་ཏེ།
en: I do not seek the Śrāvakayāna or the Pratyekabuddhayāna.

source: བླ་ན་མེད་པའི་ཐེག་པ་འཚལ་བ་ལགས་ཀྱིས།
en: I seek the highest yāna.

source: ཀྱེ་མཁན་པོ་ཡུད་ཙམ་ཞིག་གཞེས་ལ་བདག་སེང་གེའི་སྒྲ་སྒྲོགས་པ་ལ་གསོན་ཅིག །
en: Dear upādhyāya, wait a short while to listen to my lion’s roar.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་དེ་ནས་ཕྱིར་བྱུང་སྟེ། རང་གི་བསྙེན་བཀུར་བ་བྲམ་ཟེའི་ཁྱེའུ་ལྔ་པོ་དག་ལ་བོས་ཏེ་སྨྲས་པ། ཀྱེ་ཁྱེའུ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ཅིག །དེ་དག་གིས་ཀྱང་སྨྲས་པ།
en: Then, noble son, the brahmin Samudrareṇu left him and summoned his five young brahmin attendants and said to them, ‘O boys, develop the aspiration for the highest, most complete enlightenment!’ “

source: བདག་ཅག་ལ་གང་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་དབུལ་བར་བགྱི་བ་ཆུང་ཟད་ཀྱང་མ་མཆིས་ལགས་ན་དགེ་བའི་རྩ་བ་མ་བསྲུངས་པ་བདག་ཅག་གིས་ཇི་ལྟར་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱི།
en: They said, ‘We do not have anything to offer to the Buddha and the saṅgha of bhikṣus, so how can we who have not planted good roots develop the aspiration for enlightenment?’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་བསྙེན་བཀུར་བ་དང་པོ་ལོ་ཐང་སྤྱོད་ཅེས་བྱ་བ་དེ་ལ་ནི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཁ་དོག་གི་རྒྱན་དག་བྱིན།
en: Then, noble son, the chief royal priest, the brahmin Samudrareṇu, gave adornments with the colors of the seven jewels to the first attendant named Karabhuja.

source: བསྙེན་བཀུར་བ་གཉིས་པ་ཐང་ལ་སྤྱོད་ཅེས་བྱ་བ་དེ་ལ་ནི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རྣ་ཆ་བྱིན།
en: To the second attendant, Sthālabhuja, he gave a pair of earrings made of the seven jewels.

source: བསྙེན་བཀུར་བ་གསུམ་པ་ཆུ་ལ་སྤྱོད་ཅེས་བྱ་བ་དེ་ལ་ནི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཁྲི་བྱིན།
en: To the third attendant, Jalabhuja, he gave a seat made of the seven jewels.

source: བསྙེན་བཀུར་བ་བཞི་པ་ཤུགས་ཀྱིས་སྤྱོད་ཅེས་བྱ་བ་དེ་ལ་ནི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཁར་བ་བྱིན།
en: To the fourth attendant, Vegabhuja, he gave a staff made of the seven jewels.

source: བསྙེན་བཀུར་བ་ལྔ་པ་སྙིང་པོ་སྤྱོད་ཅེས་བྱ་བ་དེ་ལ་ནི་གསེར་གྱི་རི་ལ་བྷྲིང་ག་ར་བྱིན་ནས་སྨྲས་པ།
en: To the fifth attendant, Sārabhuja, he gave a vase made entirely of gold.

source: བྲམ་ཟེའི་ཁྱེའུ་དག་ཁྱེད་ཅག་དེང་ལ་དངོས་པོ་འདི་དག་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཕུལ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ཅིག །
en: He said, ‘Go, youths, and offer these things to the Buddha and the saṅgha of bhikṣus and develop the aspiration for the highest, most complete enlightenment.’ “

source: དེ་ནས་བསྙེན་བཀུར་བ་ལྔ་པོ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་དོང་སྟེ་དེ་ལྟར་བཀུར་བའི་དངོས་པོ་དེ་དག་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཕུལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཁྱོད་ཀྱིས་བདག་ཅག་བསྐལ་པ་བཟང་པོ་དེ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བར་བདག་ཅག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་དུ་གསོལ།
en: The five attendants then went before the Bhagavat and offered the things they had brought to the Buddha and the saṅgha of bhikṣus and said these words: ‘Bhagavat, we pray that you give us your prophecy of our attainment of the complete enlightenment of perfect buddhahood in the Bhadraka eon.’ “

source: རིགས་ཀྱི་བུ་སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བྲམ་ཟེའི་ཁྱེའུ་ལོ་ཐང་སྤྱོད་ནི་བསྐལ་པ་བཟང་པོ་འདི་ལ་དེ་བཞིན་གཤེགས་པ་བརྟན་དབྱངས་ཞེས་བྱ་བར་འགྱུར་རོ། །ཞེས་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ།
en: Noble son, it continued as before until the Tathāgata Ratnagarbha prophesied enlightenment to the young brahmin Karabhuja, saying that in the Bhadraka eon he would become the Tathāgata Dṛḍhasvara.

source: །ཐང་ལ་སྤྱོད་ནི་དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་བདེ་དབང་བློ་གྲོས་ཞེས་བྱ་བར་འགྱུར་རོ། །ཆུ་ལ་སྤྱོད་ནི་དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་དོན་བཅས་གསུང་ཞེས་བྱ་བར་འགྱུར་རོ། །ཤུགས་ཀྱིས་སྤྱོད་ནི་དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་དགའ་བ་དང་བ་ཞེས་བྱ་བར་འགྱུར་རོ། །བྲམ་ཟེའི་ཁྱེའུ་སྙིང་པོ་སྤྱོད་ནི་དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སེང་གེའི་བཤེས་གཉེན་གཙུག་ཕུད་ཅེས་བྱ་བར་འགྱུར་རོ།
en: Then he prophesied to the others that, after Karabhuja, Sthālabhuja would become the Tathāgata Sukhendriyamati; after him Jalabhuja would become the Tathāgata Sārthavādi; after him Vegabhuja would become the Tathāgata Priyaprasanna; and after him Sārabhuja would become the Tathāgata Haripatracūḍa. “

source: །ཞེས་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ། །བྲམ་ཟེའི་ཁྱེའུ་ལྔ་པོ་དེ་དག་བསྐལ་པ་བཟང་པོར་ལུང་བསྟན་མ་ཐག་ཏུ་མདུན་ན་འདོན་གྱིས་ཡང་བྲམ་ཟེའི་ཁྱེའུ་སྟོབས་ཆེན་ཤུགས་འཆང་ལ་སྨྲས་པ། སྟོབས་ཆེན་ཤུགས་འཆང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་ལོང་ཤིག །སྨོན་ལམ་ཇི་ལྟ་བུ་འདོད་པ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཐོབ་ཤིག །
en: As soon as those five brahmin youths were given the prophecies of their enlightenment in the Bhadraka eon, the royal priest again said to the brahmin youth Mahābalavegadhārin, ‘Mahābalavegadhārin, choose the arrays of buddha-realm qualities, and in the presence of the Bhagavat make the aspiration that you wish.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཆོས་ཀྱི་བཅུད་ཀྱིས་འགྲོན་དུ་གཉེར་ཅིག །བརྩོན་འགྲུས་བརྟན་པོས་རང་གི་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་ཡང་སྤྱོད་ལ།
en: Nurture beings with the elixir of the Dharma, and perform your bodhisattva conduct with unwavering diligence.

source: ཡང་དང་ཡང་དུ་རིང་དུ་མ་རྟོག་ཤིག་ཅེས་ལག་པ་ནས་བཟུང་སྟེ་བཅོམ་ལྡན་འདས་ལ་ཕུལ་ལོ།
en: Don’t think about this over and over for a long time!’ And he took him by the hand and brought him before the Bhagavat. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྟོབས་ཆེན་ཤུགས་འཆང་དེ་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ་གསོལ་པ། བཅོམ་ལྡན་འདས་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་དེ་ལ་ཐུབ་པ་ཉི་མ་མང་ཉུང་ཇི་སྙེད་ཅིག་འབྱུང་བར་འགྱུར་ལགས།
en: Then, noble son, the brahmin youth Mahābalavegadhārin sat before the Bhagavat and asked, ‘Bhagavat, in the future, how many sun-like sages will rise in the Bhadraka eon?’ “

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། བྲམ་ཟེའི་ཁྱེའུ་བསྐལ་པ་བཟང་པོ་དེ་ལ་ནི་ཐུབ་པ་ཉི་མ་སྟོང་རྩ་བཞི་འབྱུང་བར་འགྱུར་རོ། །བྲམ་ཟེའི་ཁྱེའུས་གསོལ་པ།
en: The Tathāgata Ratnagarbha answered, ‘Brahmin youth, in that Bhadraka eon there will rise 1,004 sun-like sages.’ “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བསྐལ་པ་ཆེན་པོ་བཟང་པོ་དེ་ལ་རྒྱལ་བ་ཉི་མ་གང་དག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དེ་དག་གི་ཐ་མར་བྲམ་ཟེའི་ཁྱེའུ་གཅེས་ལག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་དེ་བཞིན་གཤེགས་པ་སེང་གེའི་བཤེས་གཉེན་གཙུག་ཕུད་ཅེས་བགྱི་བར་འགྱུར་བ་དེ་སྲིད་དུ་ཡུན་རིང་པོར་བདག་གིས་བརྟུལ་ཞུགས་དང་། དཀའ་ཐུབ་དང་། སྤྱོད་པ་དང་། སྦྱིན་པ་དང་། དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པ་དང་། ཐོས་པ་དང་། བརྩོན་འགྲུས་དང་། བཟོད་པ་དང་།
en: Bhadanta Bhagavat,’ declared the brahmin youth, ‘until the last of those sun-like jinas pass into parinirvāṇa in the great Bhadraka eon, after the brahmin youth named Sārabhuja has attained the complete enlightenment of perfect buddhahood and become the tathāgata named Haripatracūḍa—until then, I will for that long perform the conduct of a bodhisattva, gathering the various accumulations of observances, ascetic conduct, generosity, discipline, vows, listening, diligence, patience, rejoicing, merit, and wisdom.

source: དེས་པ་དང་། བསོད་ནམས་དང་། ཤེས་རབ་ཀྱི་ཚོགས་སྣ་ཚོགས་དག་ཡང་དག་པར་བསྡུ་ཞིང་བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་སྤྱད་པར་བགྱིའོ། །བསྐལ་པ་བཟང་པོ་པ་དེ་དག་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རིང་པོ་མ་ལོན་པར་དང་པོར་བསོད་སྙོམས་ཀྱང་དབུལ་བར་བགྱིའོ།
en: Immediately after each of those of the Bhadraka eon has attained complete enlightenment, may I offer them their first alms.

source: །ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་རྣམས་ཀྱི་སྐུ་གདུང་དག་ལ་ཡང་མཆོད་པར་བགྱིའོ།
en: May I make offerings to their relics when they have passed into parinirvāṇa.

source: །དེ་དག་གིས་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པར་ཡང་གྱུར་ཅིག །
en: May I be one who upholds their good Dharma.

source: སེམས་ཅན་ཚུལ་ཁྲིམས་དང་བྲལ་བ་རྣམས་ནི་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་དང་འཛུད་ཅིང་རབ་ཏུ་འགོད་པར་གྱུར་ཅིག །
en: May I make beings who do not have correct conduct enter into and maintain perfect good conduct.

source: སེམས་ཅན་ལྟ་བ་དང་བྲལ་ཞིང་ཉམ་ང་བ་ཐོབ་པར་གྱུར་པ་རྣམས་ནི་ཡང་དག་པའི་ལྟ་བ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་དང་། འཛུད་ཅིང་རབ་ཏུ་འགོད་པར་གྱུར་ཅིག །
en: May I make beings who do not have the view gain the correct view and be established in it.

source: དེ་བཞིན་དུ་བསམ་པ་དང་བྲལ་བ་རྣམས་ནི་ཡང་དག་པའི་བསམ་པ་ལ་རབ་ཏུ་འགོད་པར་གྱུར་ཅིག །
en: In the same way, may I establish those without aspiration in the correct aspiration.
